# відмінювання іменників четвертої групи на -us, -ei в G.Sg ( -us, -u)

from random import choice

hint_template = """|               |         m         |         n         |         f         |
|---------------|-------------------|-------------------|-------------------|
|       |  N    |        -us        |        -u         |        -es        |
|       |-------|-------------------|-------------------|-------------------|
|       |  G    |        -us        |        -us        |        -ei        |
|       |-------|-------------------|-------------------|-------------------|
|       |  D    |        -ui        |        -u         |        -ei        |
|   Sg  |-------|-------------------|-------------------|-------------------|
|       |  Ac   |        -um        |        -u         |        -em        |
|       |-------|-------------------|-------------------|-------------------|
|       |  Ab   |        -u         |        -u         |        -e         |
|       |-------|-------------------|-------------------|-------------------|
|       |  V    |        -us        |        -u         |        -es        |
|-------|-------|-------------------|-------------------|-------------------|
|       |  N    |        -us        |        -ua        |        -es        |
|       |-------|-------------------|-------------------|-------------------|
|       |  G    |        -uum       |        -uum       |        -erum      |
|       |-------|-------------------|-------------------|-------------------|
|       |  D    |        -ibus      |        -ibus      |        -ebus      |
|   Pl  |-------|-------------------|-------------------|-------------------|
|       |  Ac   |        -us        |        -ua        |        -es        |
|       |-------|-------------------|-------------------|-------------------|
|       |  Ab   |        -ibus      |        -ibus      |        -ebus      |
|       |-------|-------------------|-------------------|-------------------|
|       |  V    |        -us        |        -ua        |        -es        |"""

decl_list = ['G, sg', 'D, sg',
             'Ac, sg', 'Ab, sg', 'V, sg', 'N, pl', 'G, pl', 'D, pl',
             'Ac, pl', 'Ab, sg', 'V, pl']

vocabular = ['status, -us, стан', 'genu, -us, коліно', 'res, -i, річ, предмет', 'cultus, -us, виховання, обробіток, турбота', 'lacus, -us, озеро, став', 'occasus, -us, захід, вечір, кінець', 'passus, -us, крок, слід ноги, стопа, рух', 'senatus, -us, сенат', 'principatus, -us, першість, керівна роль ', 'exercitus, -us, тренування, вправа']


def get_random_decl(data):
    var = choice(data)
    var2 = choice(decl_list)
    print(var, ' | ', var2)
    print(hint_template)
    return ''

var = ''

while var != '1':
    random_decl = get_random_decl(vocabular)
    print(random_decl)
    var = input()

print("bye-bye")


